# Weather Observation Station 20
https://www.hackerrank.com/challenges/weather-observation-station-20/problem

A median is defined as a number separating the higher half of a data set from the lower half. Query the median of the Northern Latitudes (LAT_N) from STATION and round your answer to 4 decimal places.

The STATION table is described as follows:

| Field | Type |
|----|-----|
| ID  | NUMBER   |
| CITY  | VARCHAR2(21)   |
| STATE  | VARCHAR2(2)   |
| LAT_N  | NUMBER   |
| LONG_W  | NUMBER   |

In [1]:
import re
import pandas as pd

In [2]:
path_to_file = "../../../data/sql_data/median_problem_input.txt"

In [3]:
def read_in_txt(filepath):
    pattern = "(?<=\\d)*(?=[A-Z]{2})"
    columns = ["id", "city", "state", "n_lat", "w_long"]
    records = []
    with open(path_to_file, "r") as f:
        for line in f:
            if line == "\n":
                pass
            else:
                split_str = re.split(pattern, line)
                first_part = split_str[0].strip().split(" ", 1)
                record = {k: v.strip() for k, v in zip(columns, first_part)}
                record["id"]= int(record["id"])
                record_2 = {k: v for k, v in zip(columns[2:], split_str[1].split())}
                record_2["w_long"] = float(record_2["w_long"])
                record_2["n_lat"] = float(record_2["n_lat"])
                record.update(record_2)
                records.append(record)
    return records

In [4]:
records = read_in_txt(filepath=path_to_file)

In [5]:
df = pd.DataFrame(records)

In [6]:
df.head()

    id          city state       n_lat      w_long
0  794  Kissee Mills    MO  139.650365   73.416099
1  824      Loma Mar    CA   48.697886  130.539354
2  603    Sandy Hook    CT   72.337480  148.240077
3  478        Tipton    IN   33.547927   97.942860
4  619     Arlington    CO   75.179931   92.946159

In [7]:
df.n_lat.median().round(4)

85.7613

In [8]:
statement = \
"""
SELECT CAST(ROUND(ordered.LAT_N, 4) AS DECIMAL(8, 4))
FROM 
    (SELECT LAT_N, ROW_NUMBER() OVER (ORDER BY LAT_N ASC) AS Row
     FROM STATION) AS ordered
WHERE ordered.Row =  (SELECT 
                      CASE WHEN COUNT
                      COUNT(*)/2 + 1 FROM STATION)
"""

# Consecutive numbers

https://leetcode.com/problems/consecutive-numbers/

SQL Schema
Table: Logs

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| num         | varchar |


id is the primary key for this table.
 

Write an SQL query to find all numbers that appear at least three times consecutively.

Return the result table in any order.

The query result format is in the following example:

 

Logs table:

| Id | Num |
|----|-----|
| 1  | 1   |
| 2  | 1   |
| 3  | 1   |
| 4  | 2   |
| 5  | 1   |
| 6  | 2   |
| 7  | 2   |


Result table:

| ConsecutiveNums |
|-----------------|
| 1               |

1 is the only number that appears consecutively for at least three times.

In [10]:
create_table_statment = \
"""
Create table If Not Exists Logs (Id int, Num int)
Truncate table Logs
insert into Logs (Id, Num) values ('1', '1')
insert into Logs (Id, Num) values ('2', '1')
insert into Logs (Id, Num) values ('3', '1')
insert into Logs (Id, Num) values ('4', '2')
insert into Logs (Id, Num) values ('5', '1')
insert into Logs (Id, Num) values ('6', '2')
insert into Logs (Id, Num) values ('7', '2')
"""

In [12]:
statement = \
"""
select distinct a.num as ConsecutiveNums 
from logs a 
inner join logs b on a.id = b.id-1
inner join logs c on b.id = c.id-1
where a.num = b.num and b.num = c.num
"""